{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2", "config": {"name": "model_1", "layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 125], "sparse": false}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 125], "sparse": false}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"input_length": 111, "embeddings_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "input_dim": 153, "output_dim": 152, "name": "embedding_1", "trainable": true, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 111], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}}, "class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"input_length": null, "embeddings_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "input_dim": 153, "output_dim": 400, "name": "embedding_2", "trainable": true, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}}, "class_name": "Embedding", "name": "embedding_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "unit_forget_bias": true, "dropout": 0.5, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "return_sequences": false, "return_state": true, "stateful": false, "activation": "tanh", "recurrent_constraint": null, "recurrent_regularizer": null, "unroll": false, "name": "lstm_1", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 400, "implementation": 1}, "class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"config": {"go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "unit_forget_bias": true, "dropout": 0.5, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "return_state": true, "stateful": false, "activation": "tanh", "recurrent_constraint": null, "recurrent_regularizer": null, "unroll": false, "name": "lstm_2", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 400, "implementation": 1}, "class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["embedding_2", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]]}, {"config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "name": "dense_1", "trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "units": 153, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}